{
  "topics": [
    {
      "id": "earth",
      "title": "Earth",
      "icon": "🌎",
      "type": "planet",
      "description": "Our home planet, Earth, is the third planet from the Sun and the only astronomical object known to harbor life. About 71% of Earth's surface is water-covered, with oceans constituting most of this water. Its atmosphere consists primarily of nitrogen and oxygen, and it has a powerful magnetic field generated by its molten outer core. Earth orbits the Sun at an average distance of about 93 million miles, completing one orbit every 365.25 days. Its single natural satellite, the Moon, is the fifth-largest moon in the Solar System.",
      "image": "images/earth.jpg",
      "audio": "audio/earth.mp3",
      "facts": [
        "Earth's circumference at the equator is about 24,901 miles (40,075 km)",
        "Earth is approximately 4.54 billion years old",
        "The highest point on Earth is Mount Everest at 29,032 feet above sea level",
        "The deepest known point is the Challenger Deep in the Mariana Trench at 36,070 feet below sea level"
      ]
    },
    {
      "id": "mars",
      "title": "Mars",
      "icon": "🔴",
      "type": "planet",
      "description": "Mars is the fourth planet from the Sun and the second-smallest planet in the Solar System. Mars is often called the 'Red Planet' due to its reddish appearance, which is caused by iron oxide (rust) on its surface. The planet has a thin atmosphere primarily composed of carbon dioxide. Mars has two small moons, Phobos and Deimos, which may be captured asteroids. Mars has polar ice caps made of water and carbon dioxide ice, and evidence suggests that liquid water may still flow on the planet's surface. Mars is currently the most explored planet beyond Earth, with multiple rovers and orbiters studying its surface and atmosphere.",
      "image": "images/mars.jpg",
      "audio": "audio/mars.mp3",
      "facts": [
        "Mars has the largest dust storms in the solar system, sometimes engulfing the entire planet",
        "A day on Mars is 24.6 hours, slightly longer than Earth's",
        "Mars has the tallest mountain in the solar system: Olympus Mons (72,000 ft)",
        "Temperatures on Mars can range from -195°F (-125°C) near the poles to 70°F (20°C) near the equator"
      ]
    },
    {
      "id": "hubble",
      "title": "Hubble Telescope",
      "icon": "🔭",
      "type": "spacecraft",
      "description": "The Hubble Space Telescope is a space telescope that was launched into low Earth orbit in 1990 and remains in operation. It's one of the largest and most versatile space telescopes and has been instrumental in numerous astronomical discoveries. Named after astronomer Edwin Hubble, it was built by NASA with contributions from the European Space Agency. Hubble's position above the atmosphere provides it with a view unobscured by atmospheric distortion. The telescope has undergone several servicing missions to repair and upgrade its systems, allowing it to continue operating decades beyond its planned lifespan.",
      "image": "images/hubble.jpg",
      "audio": "audio/hubble.mp3",
      "facts": [
        "Hubble orbits Earth at about 340 miles (547 km) above the surface",
        "It completes one orbit around Earth every 97 minutes",
        "The telescope's primary mirror is 7.9 feet (2.4 meters) in diameter",
        "Hubble has made over 1.3 million observations since its launch"
      ]
    },
    {
      "id": "blackhole",
      "title": "Black Holes",
      "icon": "⚫",
      "type": "phenomenon",
      "description": "A black hole is a region of spacetime where gravity is so strong that nothing—no particles or even electromagnetic radiation such as light—can escape from it. The boundary of the region from which no escape is possible is called the event horizon. Black holes form when very massive stars collapse at the end of their life cycle. Supermassive black holes exist at the center of most galaxies, including our own Milky Way. In 2019, the Event Horizon Telescope collaboration released the first direct image of a black hole, specifically the supermassive black hole at the center of galaxy M87.",
      "image": "images/blackhole.jpg",
      "audio": "audio/blackhole.mp3",
      "facts": [
        "Black holes do not 'suck' matter in; objects fall into them due to gravity",
        "Time appears to slow down near a black hole due to gravitational time dilation",
        "The point of infinite density at the center of a black hole is called a singularity",
        "Stellar black holes can have masses up to 20 times that of the Sun"
      ]
    },
    {
      "id": "iss",
      "title": "International Space Station",
      "icon": "🛰️",
      "type": "spacecraft",
      "description": "The International Space Station (ISS) is a modular space station in low Earth orbit. It's a multinational collaborative project involving NASA, Roscosmos, JAXA, ESA, and CSA. The station serves as a laboratory for scientific research in microgravity. The ISS maintains an orbit with an average altitude of 248 miles (400 km) above Earth. It travels at a speed of about 17,500 mph (28,000 km/h), completing one orbit every 90 minutes. The space station has been continuously occupied since November 2000, making it the longest continuous human presence in low Earth orbit.",
      "image": "images/iss.jpg",
      "audio": "audio/iss.mp3",
      "facts": [
        "The ISS is about the size of a football field, with a mass of about 925,335 pounds",
        "It has more livable space than a 6-bedroom house, with 6 sleeping quarters and 2 bathrooms",
        "The solar array wingspan is 240 feet, wider than a Boeing 777's wingspan",
        "Astronauts on the ISS see 16 sunrises and sunsets every day"
      ]
    },
    {
      "id": "jupiter",
      "title": "Jupiter",
      "icon": "🪐",
      "type": "planet",
      "description": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It's a gas giant with a mass more than two and a half times that of all the other planets in the Solar System combined. Jupiter is known for its Great Red Spot and numerous moons. The Great Red Spot is a giant storm that has been raging for at least 400 years. Jupiter has at least 79 moons, with the four largest, known as the Galilean moons (Io, Europa, Ganymede, and Callisto), being discovered by Galileo Galilei in 1610. The planet is primarily composed of hydrogen and helium, similar to the composition of the Sun.",
      "image": "images/jupiter.jpg",
      "audio": "audio/jupiter.mp3",
      "facts": [
        "Jupiter has the shortest day of all the planets, completing one rotation in about 10 hours",
        "It has a faint ring system, much less visible than Saturn's",
        "Jupiter's moon Ganymede is the largest moon in our solar system",
        "The Great Red Spot could fit about three Earths inside it"
      ]
    },
    {
      "id": "nebula",
      "title": "Nebulae",
      "icon": "☁️",
      "type": "phenomenon",
      "description": "A nebula is an interstellar cloud of dust, hydrogen, helium and other ionized gases. Nebulae are often star-forming regions where dense concentrations of gas and dust collapse under their own gravity to form stars. Some nebulae come from the gas and dust thrown out by the explosion of a dying star. There are several different types of nebulae, including emission nebulae that glow with their own light, reflection nebulae that reflect the light of nearby stars, dark nebulae that appear as dark patches against brighter backgrounds, and planetary nebulae formed from the outer layers of a dying star.",
      "image": "images/nebula.jpg",
      "audio": "audio/nebula.mp3",
      "facts": [
        "The word 'nebula' comes from the Latin word for 'cloud'",
        "The Orion Nebula is visible to the naked eye, appearing as the middle 'star' in the sword of Orion",
        "Nebulae can span hundreds of light-years across",
        "The Crab Nebula is the remnant of a supernova that was observed by Chinese astronomers in 1054 AD"
      ]
    },
    {
      "id": "apollo",
      "title": "Apollo Program",
      "icon": "🚀",
      "type": "spacecraft",
      "description": "The Apollo program was a NASA space program that resulted in American astronauts making 11 spaceflights and walking on the Moon. The program ran from 1961 to 1972 with Apollo 11 achieving the first crewed lunar landing in 1969. The Apollo spacecraft consisted of three parts: the Command Module (CM), the crew's quarters and flight control section; the Service Module (SM) for propulsion and spacecraft support systems; and the Lunar Module (LM) for landing on the Moon. The program was driven by President John F. Kennedy's goal of landing a man on the Moon and returning him safely to Earth before the end of the 1960s, which was accomplished with the Apollo 11 mission.",
      "image": "images/apollo.jpg",
      "audio": "audio/apollo.mp3",
      "facts": [
        "Neil Armstrong and Buzz Aldrin spent just over 21 hours on the lunar surface during Apollo 11",
        "The Apollo program cost approximately $25.4 billion (about $153 billion in today's dollars)",
        "Apollo 13's mission to the Moon was aborted after an oxygen tank exploded, but the crew returned safely",
        "The last human to walk on the Moon was Eugene Cernan in December 1972 during Apollo 17"
      ]
    }
  ]
}